#include "global.h"
#include "macros.h"
#include "camera.h"

typedef struct UnkStruct_800E60DC_s {
    void* (*unk0)(void*);
    s16 unk4;
} UnkStruct_800E60DC;

typedef struct UnkStruct_801CED60_s {
    s8 unk0;
    s8 unk1;
    char pad[0x8];
} UnkStruct_801CED60;

typedef struct UnkStruct_801CEBE0 {
    /* 0x00 */ Vec3f unk0;
    /* 0x0C */ Vec3f unkC;
    /* 0x18 */ s32 pad18;
    /* 0x1C */ u8 unk1C;
    s32 pad;
    /* 0x24 */ Vec3f unk24;
    /* 0x30 */ Vec3f unk30;
    /* 0x3C */ Vec3f unk3C;
} UnkStruct_801CEBE0; /* size = 0x48 */

typedef struct UnkStruct_80099858 {
    char unk0;
    char unk1;
    char unk2;
    s16 unk4;
    s16 unk6;
    s16 unk8;
} UnkStruct_80099858;

typedef struct UnkStruct_80099858_1 {
    s16 unk0;
    s16 unk2;
    s16 unk4;
} UnkStruct_80099858_1;

typedef struct UnkStruct_801CF008 {
    f32 unk0;
    char pad[0x14];
} UnkStruct_801CF008;

typedef struct UnkStruct_801CF058 {
    char pad[0x1C];
    s16 unk20;
    f32 unk22;
    char pad1[0x64];
    f32 unk88;
} UnkStruct_801CF058;

typedef struct UnkStruct_8009BB98 {
    s32 unk0;
    f32 y;
    s32 unk8;
    s32 unkC;
    f32 unk10;
} UnkStruct_8009BB98;

typedef struct UnkStruct_80099D94 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ f32 unk4C; /* inferred */
    /* 0x50 */ f32 unk50; /* inferred */
    /* 0x54 */ f32 unk54; /* inferred */
    /* 0x58 */ f32 unk58;
    /* 0x5C */ char pad5C[8]; /* maybe part of unk58[3]? */
    /* 0x64 */ f32 unk64;     /* inferred */
    /* 0x68 */ s32 unk68;
    /* 0x6C */ char pad6C[4];
    /* 0x70 */ f32 unk70; /* inferred */
    /* 0x74 */ f32 unk74; /* inferred */
    f32 unk78;
    f32 unk7C;
    f32 unk80;
    f32 unk84;
} UnkStruct_80099D94;

extern u8 D_801CEAA6[];
extern struct UnkStruct_801CEBE0 D_801CEBE0[];
extern f32 D_801CEFE0[];
extern s16 D_801CEFE8[];
extern s16 D_801CEFEC[];
extern u8 D_801CEFF0[];
extern s32 D_800D48DC;
extern s32 D_800E5138;
extern u8 D_800E514C;
extern u8 D_801CEAA8;
extern s32 D_800E56AC;
extern s32 D_800E56E0;
extern struct UnkStruct_801CF008 D_801CF008[];
extern struct UnkStruct_801CF058* D_801CF058[];
extern s32 D_801D06B8;
extern UnkStruct_801CED60 D_801CED60[32];
extern UnkStruct_801CED60 D_801CEEA0[32];
extern f32 D_800EB954;
extern f32 D_800EB958;
extern f32 D_800EB95C;
extern f32 D_800EB960;
extern f32 D_800EB964;
extern f64 D_800EB968;
extern f64 D_800EB970;
extern f64 D_800EB978;
extern f32 D_800EB980;
extern f32 D_800EB984;
extern f32 D_800EB988;
extern f32 D_800EB98C;
extern f32 D_800EB990;
extern f32 D_800EB994;
extern f32 D_801D075C;
extern f32 D_801D0760;
